<a href="https://colab.research.google.com/github/sagarsahu123/DMDW-Lab/blob/main/Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
list=['mango','orange','apple','guava']
df=pd.DataFrame(list)
df

        0
0   mango
1  orange
2   apple
3   guava

In [2]:
data={'Name':['soumya','shahid','nitish','kalpana'], 'Age':[20,19,18,20]}
df=pd.DataFrame(data)
df

      Name  Age
0   soumya   20
1   shahid   19
2   nitish   18
3  kalpana   20

In [3]:
data1={'Name':['soumya','shahid','nitish','kalpana'
], 'Age':[20,19,18,20], 'Address':['hariwon','kalaiya','biratnagar','malangwa'], 'Qualification':['B.Tech','B.Tech','B.Tech','B.Tech']}
df=pd.DataFrame(data1)
df

      Name  Age     Address Qualification
0   soumya   20     hariwon        B.Tech
1   shahid   19     kalaiya        B.Tech
2   nitish   18  biratnagar        B.Tech
3  kalpana   20    malangwa        B.Tech

In [4]:
import pandas as pd
import numpy as np
dict={'First Score':[100,90,np.nan,95],
      'Second Score':[34,53,43,np.nan],
      'Third Score':[np.nan,54,64,76]}
df=pd.DataFrame(dict)
df.isnull
df

   First Score  Second Score  Third Score
0        100.0          34.0          NaN
1         90.0          53.0         54.0
2          NaN          43.0         64.0
3         95.0           NaN         76.0

In [5]:
dict1={'First Score':[100,90,np.nan,95],
      'Second Score':[34,53,43,np.nan],
      'Third Score':[np.nan,54,64,76]}
df=pd.DataFrame(dict1)
df.fillna(0.0)
df

   First Score  Second Score  Third Score
0        100.0          34.0          NaN
1         90.0          53.0         54.0
2          NaN          43.0         64.0
3         95.0           NaN         76.0

In [6]:
# importing pandas as pd
import pandas as pd
  
# dictionary of lists
dict = {'name':['soumya','shahid','nitish','kalpana'],
        'degree': ["BTECH", "CSIT", "M.Tech", "MBA"],
        'score':[95, 48, 88, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
# iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      soumya
degree     BTECH
score         95
Name: 0, dtype: object

1 name      shahid
degree      CSIT
score         48
Name: 1, dtype: object

2 name      nitish
degree    M.Tech
score         88
Name: 2, dtype: object

3 name      kalpana
degree        MBA
score          98
Name: 3, dtype: object

In [7]:
# importing pandas as pd
import pandas as pd
   
# dictionary of lists
dict = {'name':['soumya','shahid','nitish','kalpana'],
        'degree': ["BTECH", "CSIT", "M.Tech", "MBA"],
        'score':[95, 48, 88, 98]}
  
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

      name  degree  score
0   soumya   BTECH     95
1   shahid    CSIT     48
2   nitish  M.Tech     88
3  kalpana     MBA     98